#pragma once
#include <vector>
#include <QString>
#include <QMap>

#include "../common.h"

using KeyboardRows = std::vector<std::vector<const char*>>;
struct KeyboardData {
    const char* displayName;
    QMap<QString, KeyboardRows> popupMap;
};

const QMap<QString, KeyboardData> KEYBOARD_MAP = {
    {"vi-VN", {
        "VN",
        {
            // A
            {"a", {
                {"â", "ấ", "ầ", "ẩ", "ẫ", "ậ"},
                {"ă", "ắ", "ằ", "ẳ", "ẵ", "ặ"},
                { "", "á", "à", "ả", "ã", "ạ"},
            }},
            {"A", {
                {"Â", "Ấ", "Ầ", "Ẩ", "Ẫ", "Ậ"},
                {"Ă", "Ắ", "Ằ", "Ẳ", "Ẵ", "Ặ"},
                { "", "Á", "À", "Ả", "Ã", "Ạ"},
            }},

            // E
            {"e", {
                {"ê", "ế", "ề", "ể", "ễ", "ệ"},
                { "", "é", "è", "ẻ", "ẽ", "ẹ"},
            }},
            {"E", {
                {"Ê", "Ế", "Ề", "Ể", "Ễ", "Ệ"},
                { "", "É", "È", "Ẻ", "Ẽ", "Ẹ"},
            }},

            // U
            {"i", {
                {"í", "ì", "ỉ", "ĩ", "ị"},
            }},
            {"I", {
                {"Í", "Ì", "Ỉ", "Ĩ", "Ị"},
            }},

            // O
            {"o", {
                {"ô", "ố", "ồ", "ổ", "ỗ", "ộ"},
                {"ơ", "ớ", "ờ", "ở", "ỡ", "ợ"},
                { "", "ó", "ò", "ỏ", "õ", "ọ"},
            }},
            {"O", {
                {"Ô", "Ố", "Ồ", "Ổ", "Ỗ", "Ộ"},
                {"Ơ", "Ớ", "Ờ", "Ở", "Ỡ", "Ợ"},
                { "", "Ó", "Ò", "Ỏ", "Õ", "Ọ"},
            }},

            // U
            {"u", {
                {"ư", "ứ", "ừ", "ử", "ữ", "ự"},
                { "", "ú", "ù", "ủ", "ũ", "ụ"},
            }},
            {"U", {
                {"Ư", "Ứ", "Ừ", "Ử", "Ữ", "Ự"},
                { "", "Ú", "Ù", "Ủ", "Ũ", "Ụ"},
            }},

            // Y
            {"y", {
                {"ý", "ỳ", "ỷ", "ỹ", "ỵ"},
            }},
            {"Y", {
                {"Ý", "Ỳ", "Ỷ", "Ỹ", "Ỵ"},
            }},
        },
    }},
};
